* Emacs tips
  @->[
  [[*###%20EMACS%20TIPS%20###][### EMACS TIPS         ###]]
  [[*Emacs, save point][Emacs, save point]]
  ]
  @<-[]
	‘M-x toggle-truncate-lines’ - turn on long lines warp
	'<C-S-left>' - swap buffers

	'C-x n n' - narrow region/scope
	'C-x n w' - widen region/scope

	(paredit mode)
	selection 1 ( -> (selection)
	... same with [, {

	(selection)	<M-s> -> selection

	(paren-mode)
	<M-S> ( : foo -> (foo)
	M-up    : (foo) -> foo

  (C-c C-x C-i) start a timer (in timer)
	(C-c C-x C-o) end timer (out-timer)
	CLOCK: [2015-11-28 Sat 18:01]--[2015-11-28 Sat 18:03] =>  0:02

  C-c C-j - org goto (jump to a 1st level entry/header, while typing interactively)

  M-x org-sort-entries RET a RET # sort org entries alphabetically (?

  Save Point Position
   https://www.gnu.org/software/emacs/manual/html_node/emacs/Position-Registers.html
   C-x r SPC r   
     Record the position of point and the current buffer in register
   C-x r j r
     Jump to the position and buffer saved in register

  Display inline images
  C-c C-x C-v


******* TODO [#C] : Textured triangle in C++
				CLOCK: [2015-11-30 Mon 19:13]--[2015-11-30 Mon 19:22] =>  0:09
				[[~/.contexts/OpenGL_Bible/src/my_first_spinning_cube]] - seems like a good starting point for a spinning textured triangle
				<2015-12-28 Mon>

* Progress Matrix
|------------------+---------+------+---------+-------+--------+------+-----+-----+--------+-------+---------+-------------+-------+-------+---------+-------|
| Date             | Haskell | Prog | Houdini | Emacs | OpenGL | Math |  CG |  AI | Tinker | Games | Finance | Maintenance | House | Skate | History | Dutch |
| 170              |      55 |   24 |      18 |    17 |     10 |    9 |   7 |   6 |      6 |     6 |       4 |           5 |     3 |     2 |       2 |     1 |
| %                |    32.4 | 14.1 |    10.6 |  10.0 |    5.9 |  5.3 | 4.1 | 3.5 |    3.5 |   3.5 |     2.4 |         2.9 |   1.8 |   1.2 |     1.2 |   0.6 |
|------------------+---------+------+---------+-------+--------+------+-----+-----+--------+-------+---------+-------------+-------+-------+---------+-------|
| [[*%5B2015-01-12%20Mon%5D][{2015-01-12 Mon}]] |       1 |    1 |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*%5B2015-02-01%20Sun%5D][{2015-02-01 Sun}]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*%5B2015-09-21%20Mon%5D][{2015-09-21 Mon}]] |         |    1 |         |       |        |      |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2015-11-08 Sun>][<2015-11-08 Sun>]] |         |    1 |         |       |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*%5B2015-11-19%20Thu%5D][{2015-11-19 Thu}]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*%5B2015-11-19%20Thu%5D][{2015-11-19 Thu}]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-01-29 Fri>][<2016-01-29 Fri>]] |       1 |    1 |         |     1 |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-01-30 Sat>][<2016-01-30 Sat>]] |       1 |      |         |       |        |      |     |     |        |       |         |           1 |       |       |         |       |
| [[*<2016-02-07 Sun>][<2016-02-07 Sun>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-02-08 Mon>][<2016-02-08 Mon>]] |       1 |      |         |       |        |      |     |   1 |        |       |         |             |       |       |         |       |
| [[*<2016-02-09 Tue>][<2016-02-09 Tue>]] |         |      |         |       |        |      |     |     |      1 |       |         |             |       |       |         |       |
| [[*<2016-02-12 Fri>][<2016-02-12 Fri>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-02-26 Fri>][<2016-02-26 Fri>]] |       1 |      |       1 |       |      1 |      |     |     |        |       |       1 |             |       |       |         |       |
| [[*<2016-02-28 Sun>][<2016-02-28 Sun>]] |         |      |         |       |        |      |     |     |      1 |       |         |             |       |       |         |       |
| [[*<2016-03-02 Wed>][<2016-03-02 Wed>]] |         |      |         |       |        |      |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-02 Wed>][<2016-03-02 Wed>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-05 Sat>][<2016-03-05 Sat>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-11 Fri>][<2016-03-11 Fri>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-16 Wed> Gravity, Rocket][<2016-03-16 Wed>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-22 Tue>][<2016-03-22 Tue>]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-24 Thu>][<2016-03-24 Thu>]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-03-30 Wed>][<2016-03-30 Wed>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-04-02 Sat>][<2016-04-02 Sat>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-04-03 Sun>][<2016-04-03 Sun>]] |         |      |         |       |        |      |     |     |        |     1 |         |             |       |       |         |       |
| [[*<2016-04-04 Mon>][<2016-04-04 Mon>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-04-05 Tue>][<2016-04-05 Tue>]] |       1 |    1 |         |       |        |      |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2016-04-09 Sat>][<2016-04-09 Sat>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-13 Fri>][<2016-05-13 Fri>]] |       1 |    1 |         |       |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-04-15 Fri>][<2016-04-15 Fri>]] |       1 |    1 |         |       |      1 |      |     |   1 |        |       |         |             |       |       |         |       |
| [[*<2016-04-21 Thu>][<2016-04-21 Thu>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-04-25 Mon>][<2016-04-25 Mon>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |     1 |         |       |
| [[*<2016-04-29 Fri>][<2016-04-29 Fri>]] |         |      |       1 |     1 |        |      |     |     |      1 |       |         |             |       |       |         |       |
| [[*<2016-05-04 Wed>][<2016-05-04 Wed>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-06 Fri>][<2016-05-06 Fri>]] |         |      |         |       |        |      |     |     |      1 |       |         |             |       |       |         |       |
| [[*<2016-05-09 Mon>][<2016-05-09 Mon>]] |       1 |    1 |         |       |        |    1 |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-11 Wed>][<2016-05-11 Wed>]] |       1 |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-12 Thu>][<2016-05-12 Thu>]] |       1 |    1 |         |       |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-13 Fri>][<2016-05-13 Fri>]] |       1 |      |         |       |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-17 Tue>][<2016-05-17 Tue>]] |         |      |         |       |        |      |     |     |        |       |         |             |       |     1 |         |       |
| [[*<2016-05-19 Thu>][<2016-05-19 Thu>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-19 Thu>][<2016-05-19 Thu>]] |         |      |         |       |        |      |     |     |        |       |         |           1 |       |       |         |       |
| [[*<2016-05-23 Mon>][<2016-05-23 Mon>]] |       1 |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-24 Tue>][<2016-05-24 Tue>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-27 Fri>][<2016-05-27 Fri>]] |         |      |         |     1 |        |    1 |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2016-05-31 Tue>][<2016-05-31 Tue>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-05 Sun>][<2016-06-05 Sun>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-06 Mon>][<2016-06-06 Mon>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-07 Tue>][<2016-06-07 Tue>]] |       1 |      |         |       |        |      |     |     |        |     1 |         |             |       |       |         |       |
| [[*<2016-06-08 Wed>][<2016-06-08 Wed>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-09 Thu>][<2016-06-09 Thu>]] |       1 |      |         |       |      1 |      |     |     |        |       |         |           1 |       |       |         |       |
| [[*<2016-06-11 Sat>][<2016-06-11 Sat>]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-12 Sun> Haskell Parsers][<2016-06-12 Sun>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-12 Sun>][<2016-06-12 Sun>]] |       1 |      |       1 |       |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-13 Mon>][<2016-06-13 Mon>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-14 Tue> Idiots never give up!][<2016-06-14 Tue>]] |         |      |       1 |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-15 Wed> Mathematical Methods for Quantitative Finance, Marve, Houdini][<2016-06-15 Wed>]] |         |      |       1 |       |        |    1 |     |     |        |       |       1 |             |       |       |         |       |
| [[*<2016-06-16 Thu> Dual Univers, Haskell, AI][<2016-06-16 Thu>]] |       1 |      |         |       |        |      |     |   1 |        |     1 |         |             |       |       |         |       |
| [[*<2016-06-18 Sat> 3D-coa UV'ing tutorial][<2016-06-18 Sat>]] |         |      |         |       |        |      |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-20 Mon> Writing a haskell parser for geo Houdini format][<2016-06-20 Mon>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-23 Thu> IDO][<2016-06-23 Thu>]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-24 Fri>][<2016-06-24 Fri>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-06-25 Sat> Haskell FRP, Yampa, OpenGL][<2016-06-25 Sat>]] |       1 |    1 |         |       |      1 |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-04 Mon> I should look into Repa, Looking into Parsec, Leaving links for GLFW to look into later on b1:][<2016-07-04 Mon>]] |       1 |      |         |       |        |      |     |     |        |       |       1 |             |       |       |         |       |
| [[*<2016-07-06 Wed> VR stuff, Parser, Finance Currency JSON API, Jabber History][<2016-07-06 Wed>]] |       1 |      |         |     1 |        |      |     |     |        |       |       1 |             |       |       |         |       |
| [[*<2016-07-08 Fri> Anonymous records][<2016-07-08 Fri>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-09 Sat> Aeson open tabs][<2016-07-09 Sat>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-14 Thu> working on Flickr example, Haskell, JSON][<2016-07-14 Thu>]] |       1 |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-16 Sat> Houdini Geo parser][<2016-07-16 Sat>]] |       1 |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-20 Wed> Prepare lambda for Alex and robots, Parsers in HaskellBook][<2016-07-20 Wed>]] |         |      |         |     1 |        |      |     |     |      1 |     1 |         |             |     1 |       |         |       |
| [[*<2016-07-21 Thu> Continue learning Parsers, following Julia manual][<2016-07-21 Thu>]] |       1 |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-23 Sat> Theory of Perception: The theory of Approximation Spaces, and Rough Sets; Parser Combinators][<2016-07-23 Sat>]] |       1 |      |         |       |        |    1 |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-24 Sun> Helm-Swoop search results, Machine Learning links][<2016-07-24 Sun>]] |         |      |         |     1 |        |      |     |   1 |        |       |         |             |       |       |         |       |
| [[*<2016-07-27 Wed> Continue with Parsers][<2016-07-27 Wed>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-28 Thu> Diary time format][<2016-07-28 Thu>]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-07-28 Thu> Fabric Engine:][<2016-07-28 Thu>]] |         |      |         |       |        |      |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-05 Fri> Raspberri Pi][<2016-08-05 Fri>]] |         |      |         |       |        |      |     |     |      1 |       |         |             |       |       |         |       |
| [[*<2016-08-07 Sun> Org-mode images][<2016-08-07 Sun>]] |         |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-08 Mon> Machine Learning][<2016-08-08 Mon>]] |         |      |         |       |        |      |     |   1 |        |       |         |             |       |       |         |       |
| [[*<2016-08-18 Thu> X3: Litcube mods:][<2016-08-18 Thu>]] |         |      |         |       |        |      |     |     |        |     1 |         |             |       |       |         |       |
| [[*<2016-08-19 Fri> Anki, Dutch, Tesaurus][<2016-08-19 Fri>]] |         |      |         |       |        |      |     |     |        |       |         |             |       |       |         |     1 |
| [[*<2016-08-21 Sun> HaskellBook][<2016-08-21 Sun>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-22 Mon> Machine Learning by Tom Mitchel:][<2016-08-22 Mon>]] |         |      |         |       |        |      |     |   1 |        |       |         |             |       |       |         |       |
| [[*<2016-08-23 Tue> Rocket, Gravity, n-body][<2016-08-23 Tue>]] |         |      |       1 |       |        |    1 |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-24 Wed> Parsers, Backup, Fixing sink][<2016-08-24 Wed>]] |       1 |      |         |       |        |      |     |     |        |       |         |           1 |     1 |       |         |       |
| [[*<2016-08-25 Thu> Continue with parsing:][<2016-08-25 Thu>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-26 Fri> continue][<2016-08-26 Fri>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-28 Sun> continue][<2016-08-28 Sun>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-30 Tue> continue][<2016-08-30 Tue>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-08-31 Wed> Rust language][<2016-08-31 Wed>]] |         |    1 |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-02 Fri> Trying out Substance Designer, Rust language, Haskell Parser][<2016-09-02 Fri>]] |       1 |    1 |         |       |        |      |   1 |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-04 Sun> Parsers][<2016-09-04 Sun>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-05 Mon> Jad Nohra gitHub][<2016-09-05 Mon>]] |         |    1 |         |       |        |    1 |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-06 Tue> Guns Germs and Steal, Haskell Parser][<2016-09-06 Tue>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |       1 |       |
| [[*<2016-09-07 Wed> Parsers, Manstein plan][<2016-09-07 Wed>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |       1 |       |
| [[*<2016-09-09 Fri> Parsers progress, Fluids:][<2016-09-09 Fri>]] |       1 |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-11 Sun> Maths][<2016-09-11 Sun>]] |         |      |         |       |        |    1 |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-13 Tue> Haskell, Category Theory][<2016-09-13 Tue>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-14 Wed> Emacs Progress Matrix][<2016-09-14 Wed>]] |       1 |      |         |     1 |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-15 Thu> Houdini Lorenz][<2016-09-15 Thu>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-16 Fri> Category Theory for Haskell programmers][<2016-09-16 Fri>]] |       1 |      |         |     1 |        |    1 |     |     |        |       |         |           1 |       |       |         |       |
| [[*<2016-09-19 Mon> Continue with Houdini Fluids][<2016-09-19 Mon>]] |         |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-21 Wed> Haskell Parsers, Houdini fluids][<2016-09-21 Wed>]] |       1 |      |       1 |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-23 Fri> Haskell, JSON, parser][<2016-09-23 Fri>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-26 Mon> Credit Cards, BF2142][<2016-09-26 Mon>]] |         |      |         |       |        |      |     |     |        |     1 |         |             |     1 |       |         |       |
| [[*<2016-09-28 Wed> Parsec links, Category Theory][<2016-09-28 Wed>]] |       1 |      |         |       |        |    1 |     |     |        |       |         |             |       |       |         |       |
| [[*<2016-09-29 Thu> Haskell Parser][<2016-09-29 Thu>]] |       1 |      |         |       |        |      |     |     |        |       |         |             |       |       |         |       |
|------------------+---------+------+---------+-------+--------+------+-----+-----+--------+-------+---------+-------------+-------+-------+---------+-------|
#+TBLFM: @2$2=vsum(@4..@>)::@2$3=vsum(@4..@>)::@2$5=vsum(@4..@>)::@2$4=vsum(@4..@>)::@2$6=vsum(@4..@>)::@2$7=vsum(@4..@>)::@2$8=vsum(@4..@>)::@2$9=vsum(@4..@>)::@2$10=vsum(@4..@>)::@2$11=vsum(@4..@>)::@2$12=vsum(@4..@>)::@2$13=vsum(@4..@>)::@2$16=vsum(@4..@>)::@2$14=vsum(@4..@>)::@2$15=vsum(@4..@>)::@2$17=vsum(@4..@>)::@3$2=(@2$2/@2$1)*100;%.1f::@3$3=(@2$3 /@2$1)*100;%.1f::@3$5=(@2$5 /@2$1)*100;%.1f::@3$4=(@2$4 /@2$1)*100;%.1f::@3$6=(@2$6 /@2$1)*100;%.1f::@3$7=(@2$7 /@2$1)*100;%.1f::@3$8=(@2$8 /@2$1)*100;%.1f::@3$9=(@2$9 /@2$1)*100;%.1f::@3$10=(@2$10/@2$1)*100;%.1f::@3$11=(@2$11/@2$1)*100;%.1f::@3$12=(@2$12/@2$1)*100;%.1f::@3$13=(@2$13/@2$1)*100;%.1f::@3$16=(@2$16/@2$1)*100;%.1f::@3$14=(@2$14/@2$1)*100;%.1f::@3$15=(@2$15/@2$1)*100;%.1f::@3$17=(@2$17/@2$1)*100;%.1f::@2$1='(apply '+ '($2..$>));N

